<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class StudentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('student')->insert([
            [
                'sid' => 1,
                'fname' => 'สมชาย',
                'lname' => 'นามสกุล',
                'std_prg_id' => 1, // หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาคณิตศาสตร์
            ],
            [
                'sid' => 2,
                'fname' => 'หญิงสาว',
                'lname' => 'นามสกุล',
                'std_prg_id' => 2, // หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาชีววิทยา
            ],
            [
                'sid' => 3,
                'fname' => 'ชายหนุ่ม',
                'lname' => 'นามสกุล',
                'std_prg_id' => 3, // หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์
            ],
            [
                'sid' => 4,
                'fname' => 'หญิงสาว',
                'lname' => 'นามสกุล',
                'std_prg_id' => 4, // หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมไฟฟ้า
            ],
            [
                'sid' => 5,
                'fname' => 'ชายหนุ่ม',
                'lname' => 'นามสกุล',
                'std_prg_id' => 5, // หลักสูตรพาณิชยศาสตรบัณฑิต สาขาวิชาการตลาด
            ],
            [
                'sid' => 6,
                'fname' => 'หญิงสาว',
                'lname' => 'นามสกุล',
                'std_prg_id' => 6, // หลักสูตรพาณิชยศาสตรบัณฑิต สาขาวิชาการเงิน
            ],
            [
                'sid' => 7,
                'fname' => 'ชายหนุ่ม',
                'lname' => 'นามสกุล',
                'std_prg_id' => 7, // หลักสูตรนิติศาสตรบัณฑิต
            ],
            [
                'sid' => 8,
                'fname' => 'หญิงสาว',
                'lname' => 'นามสกุล',
                'std_prg_id' => 8, // หลักสูตรบัญชีบัณฑิต
            ],
            [
                'sid' => 9,
                'fname' => 'ชายหนุ่ม',
                'lname' => 'นามสกุล',
                'std_prg_id' => 9, // หลักสูตรศิลปกรรมศาสตรบัณฑิต สาขาวิชาออกแบบกราฟิก
            ],
            [
                'sid' => 10,
                'fname' => 'หญิงสาว',
                'lname' => 'นามสกุล',
                'std_prg_id' => 10, // หลักสูตรศิลปกรรมศาสตรบัณฑิต สาขาวิชานิเทศศาสตร์
            ],
        ]);
    }
}
